Danila-git/STM32_LABS/the_first/Src/GPIO_labs/firstlab_3.c
#include "stm32g474xx.h"

uint32_t button_is_pressed = 0;
uint32_t counter = 3;

int main(void)
{
    RCC->AHB2ENR |= RCC_AHB2ENR_GPIOBEN | RCC_AHB2ENR_GPIOEEN;

    GPIOE->MODER &= ~(GPIO_MODER_MODE3_Msk | GPIO_MODER_MODE4_Msk | GPIO_MODER_MODE5_Msk | GPIO_MODER_MODE6_Msk );
    GPIOE->MODER |= 1 << GPIO_MODER_MODE3_Pos | 1 << GPIO_MODER_MODE4_Pos | 1 << GPIO_MODER_MODE5_Pos | 1 << GPIO_MODER_MODE6_Pos;

    GPIOB->MODER &= ~(GPIO_MODER_MODE12_Msk | GPIO_MODER_MODE15_Msk);

    while(1)
    {

    	if((GPIOB->IDR & GPIO_IDR_ID12) == 0 && counter < 7 && button_is_pressed == 0)
    	{
    		button_is_pressed = 1;
    		GPIOE->BSRR |= (1 << counter);
    		counter++;
    	}
    	else if((GPIOB->IDR & GPIO_IDR_ID15) == 0)
    	{
    		for(uint32_t i = 3;i<7;i++)
    		{
            GPIOE->BSRR &= ~(1 << i);
    		}
    		counter = 3;
    	} else if (GPIOB->IDR & GPIO_IDR_ID12)
        {
            button_is_pressed = 0;
        }
    }
}
